Tekla.Structures.Model.ChangeData.ChangeTypeEnum
The types of changed event.

Tekla.Structures.Model.ChangeData.ChangeTypeEnum.OBJECT_INSERT
Object created

Tekla.Structures.Model.ChangeData.ChangeTypeEnum.OBJECT_MODIFY
Object modified

Tekla.Structures.Model.ChangeData.ChangeTypeEnum.OBJECT_DELETE
Object deleted

Tekla.Structures.Model.ChangeData.ChangeTypeEnum.USERPROPERTY_CHANGED
User property of object changed